apps/artillery/api-load-test.yml
config:
  http:
    defaults:
      headers:
        x-api-key: "9a508cb5bd527bap332330AK1b4bd9b25b9a508cb5"
  target: http://vrai-server-development.up.railway.app
  phases:
    - duration: 2
      arrivalCount: 1
      name: Sample Soak Test Phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 2000
        - http.response_time.p95: 1500
scenarios:
  - flow:
      - loop:
        # - get:
        #     url: "/v1/products/catalog?diamondType=oval&metal=yellow-gold&slug=three-stone"
        - get:
            url: "/v1/diamonds?diamondType=pear&limit=10&page=1"
        - get:
            url: "/v1/diamonds/lowestpriced/radiant"
        - get:
            url: "/v1/products/collection/diamondtypes/three-stone"
        - get:
            url: "v1/diamonds/cfy?diamondType=oval&limit=25"
        count: 1