apps/artillery/api-load-test.yml
config:
  http:
    defaults:
      headers:
        x-api-key: "9a508cb5bd527bap332330AK1b4bd9b25b9a508cb5"
  target: http://vrai-server-development.up.railway.app
  phases:
    # - duration: 60
    #   arrivalRate: 1
    #   rampTo: 5
    #   name: Warm up phase
    - duration: 5
      arrivalCount: 1
      name: API phase

  plugins:
      ensure: {}
      apdex: {}
      metrics-by-endpoint: {}
scenarios:
  - flow:
      - loop:
        - get:
            url: "/v1/products/catalog?diamondType=oval&metal=yellow-gold&slug=three-stone"
        count: 2