apps/artillery/ui-load-test.yml
config:
  target: https://main.vrai.qa
  phases:
    # - duration: 60
    #   arrivalRate: 1
    #   rampTo: 5
    #   name: Warm up phase
    - duration: 5
      arrivalCount: 1
      name: Warm up phase
  # Load the Playwright engine:
  engines:
    playwright: 
        launchOptions:
          headless: true
  # Path to JavaScript file that defines Playwright test functions
  processor: "ui/flow.js"
scenarios:
  - engine: playwright
    testFunction: "simpleFlow"